<template>
	<div class="root">
		<PostView
			v-for="post of posts"
			:key="`post-view-${post.id}`"
			:post="post"
		/>
	</div>
</template>

<script setup lang="ts">
import type { IPost } from '~/components/post/PostView.vue';

const posts = ref<IPost[]>([]);
for (let i = 2; i < 5; i++) {
	posts.value.push({
		date: `${i} дня назад`,
		title: `Добавить функцию голосования для ${i}-го поста`,
		text: `${i}: Попробовать добавить в приложение функцию голосования, которая позволит определить, какая фича более полезна, а какая нет. После добавления поста появляется Попробовать добавить в приложение функцию голосования, которая позволит определить, какая фича более полезна, а какая нет. Попробовать добавить в приложение функцию голосования, которая позволит определить, какая фича более полезна, а какая нет. Попробовать добавить в приложение функцию голосования, которая позволит определить, какая фича более полезна, а какая нет.`,
		likeCount: i * 5,
		dislikeCount: i * 2,
		id: i,
	});
}
</script>
